cases/process/hushbringer-simultaneous-death/v9-public-mutations/change-zone-resolve/mutation.patch
--- a/crates/engine/src/game/effects/change_zone.rs
+++ b/crates/engine/src/game/effects/change_zone.rs
@@ -900,13 +900,7 @@
                     ),
                     ..ctx.clone()
                 };
-                match crate::game::zones::with_departure_member(
-                    state,
-                    events,
-                    owner,
-                    *obj_id,
-                    |state, events| process_one_zone_move(state, &per_obj_ctx, *obj_id, events),
-                ) {
+                match (|| process_one_zone_move(state, &per_obj_ctx, *obj_id, events))() {
                     ZoneMoveResult::Done => {
                         if moved_to_dest(state) {
                             moved_count += 1;
