cases/process/hushbringer-simultaneous-death/v9-public-mutations/components-filter-grouping/mutation.patch
--- a/crates/engine/src/game/casting_costs.rs
+++ b/crates/engine/src/game/casting_costs.rs
@@ -1849,7 +1849,7 @@
     // the members of one selected sacrifice action share its event boundary.
     for component in pending
         .deferred_sacrificed_permanents
-        .chunk_by(|a, b| a.component == b.component)
+        .chunk_by(|a, b| a.filter == b.filter)
     {
         let candidates: Vec<_> = component
             .iter()
